In [48]:
import pandas as pd
import numpy as np

In [49]:
df_roster = pd.read_excel('./roster_ori.xlsx', dtype={"sec": str})

In [50]:
df_roster.head()

   no_reg  sec  student_id  firstname   lastname                   email
0       1  001   640610366  มนัสวีย์   ใจวงศ์ศรี   manasawee_j@cmu.ac.th
1       2  001   650610339      กรกต      แก่นพล     karakot_k@cmu.ac.th
2       3  001   650610539     ณัฏฐ์     มัลลานู  nut_mallanoo@cmu.ac.th
3       4  001   660610320    กนกรดา       มณีสม   kanokrada_m@cmu.ac.th
4       5  001   660610323    กฤติมา    จันทร์ดำ     kittima_c@cmu.ac.th

In [51]:
df_roster["firstname"] = "First" + df_roster["no_reg"].astype(str)
df_roster["lastname"] = "Last" + df_roster["no_reg"].astype(str)
df_roster["email"] = "email" + df_roster["no_reg"].astype(str) + "@cmu.ac.th"

In [52]:
np.floor(np.random.random()*1e9).astype(int)

np.int64(708758639)

In [53]:
def gen_student_id(seed):
    np.random.seed(seed)
    return np.floor(np.random.uniform(low=100000000, high=999999999)).astype(int)

gen_student_id(30)

np.int64(679729181)

In [54]:
df_roster["student_id"] = df_roster["student_id"].apply(lambda x: gen_student_id(x))

In [55]:
df_roster.head()

   no_reg  sec  student_id firstname lastname             email
0       1  001   910787990    First1    Last1  email1@cmu.ac.th
1       2  001   877304244    First2    Last2  email2@cmu.ac.th
2       3  001   288785711    First3    Last3  email3@cmu.ac.th
3       4  001   129937341    First4    Last4  email4@cmu.ac.th
4       5  001   105284582    First5    Last5  email5@cmu.ac.th

In [56]:
df_roster.to_excel("roster.xlsx", index=False)

In [57]:
df = pd.read_csv("./student_groups_ori.csv")
df.head(3)

,name,canvas_user_id,user_id,login_id,sections,group_name,canvas_group_id,group_id
0,630610340 THANCHANOK BUA-ONG,23962,630610340,thanchanok_bu@cmu.ac.th,2/67-SEC005,NaN,NaN,NaN
1,640610093 WARISSARA TIANGSAT,9026,640610093,warissara_tiangsat@cmu.ac.th,2/67-SEC006,Sec6: มี 2,22671.0,NaN
2,640610197 PHURINART HUNWAN,3447,640610197,phurinart_h@cmu.ac.th,2/67-SEC002,NaN,NaN,NaN

In [58]:
df = df[["user_id", "group_name"]]
df.head()

     user_id              group_name
0  630610340                     NaN
1  640610093             Sec6: มี 2
2  640610197                     NaN
3  640610366  Sec1: วิดวะมช.รู้จักปะ
4  640610411             Sec4: eiei

In [59]:
df["user_id"] = df["user_id"].apply(lambda x: gen_student_id(x))
df = df.rename(columns={"user_id":"student_id"})
df.head()

   student_id              group_name
0   878130557                     NaN
1   272210128             Sec6: มี 2
2   682511317                     NaN
3   910787990  Sec1: วิดวะมช.รู้จักปะ
4   576447795             Sec4: eiei

In [60]:
df.to_excel("student_groups.xlsx", index=False)